apply検証

```hcl
❯ aws-vault exec sandbox.AdministratorAccess -- terraform apply
random_string.example: Refreshing state... [id=9258274596]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cognito.aws_cognito_identity_provider.this will be created
  + resource "aws_cognito_identity_provider" "this" {
      + attribute_mapping = {
          + "email"    = "email"
          + "name"     = "name"
          + "username" = "sub"
        }
      + id                = (known after apply)
      + provider_details  = {
          + "authorize_scopes" = "profile email openid"
          + "client_id"        = "example_id"
          + "client_secret"    = "example_secret"
        }
      + provider_name     = "Google"
      + provider_type     = "Google"
      + user_pool_id      = (known after apply)
    }

  # module.cognito.aws_cognito_user_pool.this will be created
  + resource "aws_cognito_user_pool" "this" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "example"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "admin_only"
              + priority = 1
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = true
        }

      + email_configuration {
          + email_sending_account = "COGNITO_DEFAULT"
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = false
          + require_numbers                  = false
          + require_symbols                  = false
          + require_uppercase                = false
          + temporary_password_validity_days = 30
        }

      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "name"
          + required                 = true

          + string_attribute_constraints {
              + max_length = "2048"
              + min_length = "0"
            }
        }

      + sms_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # module.cognito.aws_cognito_user_pool_client.this will be created
  + resource "aws_cognito_user_pool_client" "this" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client          = true
      + allowed_oauth_scopes                          = [
          + "aws.cognito.signin.user.admin",
          + "email",
          + "openid",
          + "profile",
        ]
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = [
          + "https://example.com/oauth2/idpresponse",
        ]
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
        ]
      + generate_secret                               = true
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "alb"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = (known after apply)
      + supported_identity_providers                  = [
          + "COGNITO",
          + "Google",
        ]
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)
    }

  # module.cognito.aws_cognito_user_pool_domain.this will be created
  + resource "aws_cognito_user_pool_domain" "this" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "example-9258274596"
      + id                              = (known after apply)
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = (known after apply)
      + version                         = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.cognito.aws_cognito_user_pool.this: Creating...
module.cognito.aws_cognito_user_pool.this: Creation complete after 1s [id=ap-northeast-1_vQLHrIwRf]
module.cognito.aws_cognito_user_pool_domain.this: Creating...
module.cognito.aws_cognito_identity_provider.this: Creating...
module.cognito.aws_cognito_user_pool_client.this: Creating...
module.cognito.aws_cognito_user_pool_client.this: Creation complete after 0s [id=7l1sdeg784u5m0e7b1a58nbrfn]
module.cognito.aws_cognito_identity_provider.this: Creation complete after 1s [id=ap-northeast-1_vQLHrIwRf:Google]
module.cognito.aws_cognito_user_pool_domain.this: Creation complete after 1s [id=example-9258274596]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

destroyで後始末

```hcl
❯ aws-vault exec sandbox.AdministratorAccess -- terraform destroy
random_string.example: Refreshing state... [id=9258274596]
module.cognito.aws_cognito_user_pool.this: Refreshing state... [id=ap-northeast-1_vQLHrIwRf]
module.cognito.aws_cognito_user_pool_domain.this: Refreshing state... [id=example-9258274596]
module.cognito.aws_cognito_identity_provider.this: Refreshing state... [id=ap-northeast-1_vQLHrIwRf:Google]
module.cognito.aws_cognito_user_pool_client.this: Refreshing state... [id=7l1sdeg784u5m0e7b1a58nbrfn]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # random_string.example will be destroyed
  - resource "random_string" "example" {
      - id          = "9258274596" -> null
      - length      = 10 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 10 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "9258274596" -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.cognito.aws_cognito_identity_provider.this will be destroyed
  - resource "aws_cognito_identity_provider" "this" {
      - attribute_mapping = {
          - "email"    = "email"
          - "name"     = "name"
          - "username" = "sub"
        } -> null
      - id                = "ap-northeast-1_vQLHrIwRf:Google" -> null
      - idp_identifiers   = [] -> null
      - provider_details  = {
          - "attributes_url"                = "https://people.googleapis.com/v1/people/me?personFields="
          - "attributes_url_add_attributes" = "true"
          - "authorize_scopes"              = "profile email openid"
          - "authorize_url"                 = "https://accounts.google.com/o/oauth2/v2/auth"
          - "client_id"                     = "example_id"
          - "client_secret"                 = "example_secret"
          - "oidc_issuer"                   = "https://accounts.google.com"
          - "token_request_method"          = "POST"
          - "token_url"                     = "https://www.googleapis.com/oauth2/v4/token"
        } -> null
      - provider_name     = "Google" -> null
      - provider_type     = "Google" -> null
      - user_pool_id      = "ap-northeast-1_vQLHrIwRf" -> null
    }

  # module.cognito.aws_cognito_user_pool.this will be destroyed
  - resource "aws_cognito_user_pool" "this" {
      - arn                        = "arn:aws:cognito-idp:ap-northeast-1:477235943564:userpool/ap-northeast-1_vQLHrIwRf" -> null
      - auto_verified_attributes   = [] -> null
      - creation_date              = "2025-03-27T20:53:51Z" -> null
      - deletion_protection        = "INACTIVE" -> null
      - domain                     = "example-9258274596" -> null
      - endpoint                   = "cognito-idp.ap-northeast-1.amazonaws.com/ap-northeast-1_vQLHrIwRf" -> null
      - estimated_number_of_users  = 0 -> null
      - id                         = "ap-northeast-1_vQLHrIwRf" -> null
      - last_modified_date         = "2025-03-27T20:53:51Z" -> null
      - mfa_configuration          = "OFF" -> null
      - name                       = "example" -> null
      - tags                       = {} -> null
      - tags_all                   = {} -> null
      - username_attributes        = [] -> null
        # (5 unchanged attributes hidden)

      - account_recovery_setting {
          - recovery_mechanism {
              - name     = "admin_only" -> null
              - priority = 1 -> null
            }
        }

      - admin_create_user_config {
          - allow_admin_create_user_only = true -> null
        }

      - email_configuration {
          - email_sending_account  = "COGNITO_DEFAULT" -> null
            # (4 unchanged attributes hidden)
        }

      - password_policy {
          - minimum_length                   = 8 -> null
          - require_lowercase                = false -> null
          - require_numbers                  = false -> null
          - require_symbols                  = false -> null
          - require_uppercase                = false -> null
          - temporary_password_validity_days = 30 -> null
        }

      - schema {
          - attribute_data_type      = "String" -> null
          - developer_only_attribute = false -> null
          - mutable                  = true -> null
          - name                     = "name" -> null
          - required                 = true -> null

          - string_attribute_constraints {
              - max_length = "2048" -> null
              - min_length = "0" -> null
            }
        }

      - verification_message_template {
          - default_email_option  = "CONFIRM_WITH_CODE" -> null
            # (5 unchanged attributes hidden)
        }
    }

  # module.cognito.aws_cognito_user_pool_client.this will be destroyed
  - resource "aws_cognito_user_pool_client" "this" {
      - access_token_validity                         = 0 -> null
      - allowed_oauth_flows                           = [
          - "code",
        ] -> null
      - allowed_oauth_flows_user_pool_client          = true -> null
      - allowed_oauth_scopes                          = [
          - "aws.cognito.signin.user.admin",
          - "email",
          - "openid",
          - "profile",
        ] -> null
      - auth_session_validity                         = 3 -> null
      - callback_urls                                 = [
          - "https://example.com/oauth2/idpresponse",
        ] -> null
      - client_secret                                 = (sensitive value) -> null
      - enable_propagate_additional_user_context_data = false -> null
      - enable_token_revocation                       = true -> null
      - explicit_auth_flows                           = [
          - "ALLOW_REFRESH_TOKEN_AUTH",
        ] -> null
      - generate_secret                               = true -> null
      - id                                            = "7l1sdeg784u5m0e7b1a58nbrfn" -> null
      - id_token_validity                             = 0 -> null
      - logout_urls                                   = [] -> null
      - name                                          = "alb" -> null
      - read_attributes                               = [] -> null
      - refresh_token_validity                        = 30 -> null
      - supported_identity_providers                  = [
          - "COGNITO",
          - "Google",
        ] -> null
      - user_pool_id                                  = "ap-northeast-1_vQLHrIwRf" -> null
      - write_attributes                              = [] -> null
        # (2 unchanged attributes hidden)
    }

  # module.cognito.aws_cognito_user_pool_domain.this will be destroyed
  - resource "aws_cognito_user_pool_domain" "this" {
      - aws_account_id                  = "477235943564" -> null
      - cloudfront_distribution         = "d3vhah7crmmd43.cloudfront.net" -> null
      - cloudfront_distribution_arn     = "d3vhah7crmmd43.cloudfront.net" -> null
      - cloudfront_distribution_zone_id = "Z2FDTNDATAQYW2" -> null
      - domain                          = "example-9258274596" -> null
      - id                              = "example-9258274596" -> null
      - s3_bucket                       = "aws-cognito-prod-nrt-assets" -> null
      - user_pool_id                    = "ap-northeast-1_vQLHrIwRf" -> null
      - version                         = "20250327205352" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 0 to change, 5 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

module.cognito.aws_cognito_user_pool_domain.this: Destroying... [id=example-9258274596]
module.cognito.aws_cognito_identity_provider.this: Destroying... [id=ap-northeast-1_vQLHrIwRf:Google]
module.cognito.aws_cognito_user_pool_client.this: Destroying... [id=7l1sdeg784u5m0e7b1a58nbrfn]
module.cognito.aws_cognito_user_pool_client.this: Destruction complete after 0s
module.cognito.aws_cognito_identity_provider.this: Destruction complete after 0s
module.cognito.aws_cognito_user_pool_domain.this: Destruction complete after 1s
module.cognito.aws_cognito_user_pool.this: Destroying... [id=ap-northeast-1_vQLHrIwRf]
random_string.example: Destroying... [id=9258274596]
random_string.example: Destruction complete after 0s
module.cognito.aws_cognito_user_pool.this: Destruction complete after 0s

Destroy complete! Resources: 5 destroyed.
```